chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/**
 * @brief   Selects the I2C4 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C4_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C4_SEL                RCC_CCIPR1_I2C4SEL_PCLK1
#endif

/**
 * @brief   Selects the I2C3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_I2C3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_I2C3_SEL                RCC_CCIPR3_I2C3SEL_PCLK3
#endif

/**
 * @brief   Selects the SPI1 clock source.
 * @note    Allowed sources:
 *          - PCLK2.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI1_SEL                RCC_CCIPR1_SPI1SEL_PCLK2
#endif

/**
 * @brief   Selects the SPI2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI2_SEL                RCC_CCIPR1_SPI2SEL_PCLK1
#endif

/**
 * @brief   Selects the SPI3 clock source.
 * @note    Allowed sources:
 *          - PCLK3.
 *          - SYSCLK.
 *          - HSI16.
 *          - MSIK.
 */
#if !defined(STM32_CFG_SPI3_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SPI3_SEL                RCC_CCIPR3_SPI3SEL_PCLK3
#endif

/**
 * @brief   Selects the FDCAN1 clock source.
 * @note    Allowed sources:
 *          - HSE.
 *          - PLL1Q.
 *          - PLL2P.
 *          - inactive selection RCC_CCIPR1_FDCANSEL_IGNORE.
 */
#if !defined(STM32_CFG_FDCAN1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_FDCAN1_SEL              RCC_CCIPR1_FDCANSEL_HSE
#endif

/**
 * @brief   Selects the SYSTICK clock source.
 * @note    Allowed sources:
 *          - HCLKDIV8.
 *          - LSI.
 *          - LSESYS.
 *          - inactive selection RCC_CCIPR1_SYSTICKSEL_IGNORE.
 */
#if !defined(STM32_CFG_SYSTICK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SYSTICK_SEL             RCC_CCIPR1_SYSTICKSEL_HCLKDIV8
#endif

/**
 * @brief   Selects the ICLK clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - PLL2Q.
 *          - PLL1Q.
 *          - MSIK.
 */
#if !defined(STM32_CFG_ICLK_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ICLK_SEL                RCC_CCIPR1_ICLKSEL_HSI48
#endif

/**
 * @brief   Selects the SDMMC clock source.
 * @note    Allowed sources:
 *          - ICLK.
 *          - PLL1P.
 */
#if !defined(STM32_CFG_SDMMC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SDMMC_SEL               RCC_CCIPR2_SDMMCSEL_PLL1P
#endif

/**
 * @brief   Selects the OCTOSPI clock source.
 * @note    Allowed sources:
 *          - SYSCLK.
 *          - MSIK.
 *          - PLL1Q.
 *          - PLL2Q.
 *          - inactive selection RCC_CCIPR2_OCTOSPISEL_IGNORE.
 */
#if !defined(STM32_CFG_OCTOSPI_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_OCTOSPI_SEL             RCC_CCIPR2_OCTOSPISEL_SYSCLK
#endif

/**
 * @brief   Selects the RNG clock source.
 * @note    Allowed sources:
 *          - HSI48.
 *          - HSI48DIV2.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_RNGSEL_IGNORE.
 */
#if !defined(STM32_CFG_RNG_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_RNG_SEL                 RCC_CCIPR2_RNGSEL_HSI48
#endif

/**
 * @brief   Selects the SAI1 clock source.
 * @note    Allowed sources:
 *          - PLL2P.
 *          - PLL3P.
 *          - PLL1P.
 *          - AUDIOCLK.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_SAI1SEL_IGNORE.
 */
#if !defined(STM32_CFG_SAI1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI1_SEL                RCC_CCIPR2_SAI1SEL_PLL2P
#endif

/**
 * @brief   Selects the SAI2 clock source.
 * @note    Allowed sources:
 *          - PLL2P.
 *          - PLL3P.
 *          - PLL1P.
 *          - AUDIOCLK.
 *          - HSI16.
 *          - inactive selection RCC_CCIPR2_SAI2SEL_IGNORE.
 */
#if !defined(STM32_CFG_SAI2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_SAI2_SEL                RCC_CCIPR2_SAI2SEL_PLL2P
#endif

/**
 * @brief   Selects the MDF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - PLL1P.
 *          - PLL3Q.
 *          - AUDIOCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR2_MDF1SEL_IGNORE.
 */
#if !defined(STM32_CFG_MDF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_MDF1_SEL                RCC_CCIPR2_MDF1SEL_HCLK
#endif

/**
 * @brief   Selects the ADF1 clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - PLL1P.
 *          - PLL3Q.
 *          - AUDIOCLK.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR3_ADF1SEL_IGNORE.
 */
#if !defined(STM32_CFG_ADF1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADF1_SEL                RCC_CCIPR3_ADF1SEL_HCLK
#endif

/**
 * @brief   Selects the ADCDAC clock source.
 * @note    Allowed sources:
 *          - HCLK.
 *          - SYSCLK.
 *          - PLL2R.
 *          - HSE.
 *          - HSI16.
 *          - MSIK.
 *          - inactive selection RCC_CCIPR3_ADCDACSEL_IGNORE.
 */
#if !defined(STM32_CFG_ADCDAC_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_ADCDAC_SEL              RCC_CCIPR3_ADCDACSEL_HCLK
#endif

/**
 * @brief   Selects the DAC1SH clock source.
 * @note    Allowed sources:
 *          - LSESYS.
 *          - LSI.
 *          - inactive selection RCC_CCIPR3_DAC1SEL_IGNORE.
 */
#if !defined(STM32_CFG_DAC1SH_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_DAC1SH_SEL              RCC_CCIPR3_DAC1SEL_LSE
#endif

/**
 * @brief   Selects the LPTIM1 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM1_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM1_SEL              RCC_CCIPR3_LPTIM1SEL_MSIK
#endif

/**
 * @brief   Selects the LPTIM2 clock source.
 * @note    Allowed sources:
 *          - PCLK1.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM2_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM2_SEL              RCC_CCIPR1_LPTIM2SEL_PCLK1
#endif

/**
 * @brief   Selects the LPTIM34 clock source.
 * @note    Allowed sources:
 *          - MSIK.
 *          - LSI.
 *          - HSI16.
 *          - LSESYS.
 */
#if !defined(STM32_CFG_LPTIM34_SEL) || defined(__DOXYGEN__)
  #define STM32_CFG_LPTIM34_SEL             RCC_CCIPR3_LPTIM34SEL_MSIK
#endif
/** @} */

/*===========================================================================*/
/* Derived constants and error checks.                                       */
/*===========================================================================*/

/**
 * @name    Clock point derived constants and checks
 * @{
 */
/*
 * Extra configuration checks.
 */
#if !defined(TRUE) && !defined(__DOXYGEN__)
  #error "TRUE not defined"
#endif
#if !defined(FALSE) && !defined(__DOXYGEN__)
  #error "FALSE not defined"
#endif
#if !((STM32_CFG_CLOCK_DYNAMIC == TRUE) || (STM32_CFG_CLOCK_DYNAMIC == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_CLOCK_DYNAMIC value specified"
#endif

#if !defined(PWR_VOSR_VOS_RANGE1) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE1 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE2) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE2 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE3) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE3 not defined"
#endif
#if !defined(PWR_VOSR_VOS_RANGE4) && !defined(__DOXYGEN__)
  #error "PWR_VOSR_VOS_RANGE4 not defined"
#endif
#if !((STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE1) ||                        \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE2) ||                         \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE3) ||                         \
     (STM32_CFG_PWR_VOSR == PWR_VOSR_VOS_RANGE4)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PWR_VOSR value specified"
#endif

