chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_LSI_PREDIV == RCC_BDCR_LSIPREDIV_DIV1) ||                  \
     (STM32_CFG_LSI_PREDIV == RCC_BDCR_LSIPREDIV_DIV128)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSI_PREDIV value specified"
#endif

#if !((STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE0_48M) ||          \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE1_24M) ||           \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE2_16M) ||           \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE3_12M) ||           \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE4_4M) ||            \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE5_2M) ||            \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE6_1333K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE7_1M) ||            \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE8_3072K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE9_1536K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE10_1024K) ||        \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE11_768K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE12_400K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE13_200K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE14_133K) ||         \
     (STM32_CFG_MSIS_RANGE == RCC_ICSCR1_MSISRANGE_RANGE15_100K)) &&        \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIS_RANGE value specified"
#endif

#if !((STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE0_48M) ||          \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE1_24M) ||           \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE2_16M) ||           \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE3_12M) ||           \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE4_4M) ||            \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE5_2M) ||            \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE6_1333K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE7_1M) ||            \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE8_3072K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE9_1536K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE10_1024K) ||        \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE11_768K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE12_400K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE13_200K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE14_133K) ||         \
     (STM32_CFG_MSIK_RANGE == RCC_ICSCR1_MSIKRANGE_RANGE15_100K)) &&        \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIK_RANGE value specified"
#endif

#if !((STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_CONTINUOUS) ||               \
     (STM32_CFG_MSIBIAS == RCC_ICSCR1_MSIBIAS_SAMPLING)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MSIBIAS value specified"
#endif

#if !((STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_NOCLOCK) ||                \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIS4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIS1024_MSIK4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIS4) ||   \
     (STM32_CFG_TIMICSEL == RCC_CCIPR1_TIMICSEL_HSI256_MSIK1024_MSIK4)) &&  \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_TIMICSEL value specified"
#endif

#if !((STM32_CFG_STOPWUCK == RCC_CFGR1_STOPWUCK_MSIS) ||                    \
     (STM32_CFG_STOPWUCK == RCC_CFGR1_STOPWUCK_HSI16)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_STOPWUCK value specified"
#endif

#if !((STM32_CFG_STOPKERWUCK == RCC_CFGR1_STOPKERWUCK_MSIK) ||              \
     (STM32_CFG_STOPKERWUCK == RCC_CFGR1_STOPKERWUCK_HSI16)) &&             \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_STOPKERWUCK value specified"
#endif

#if !((STM32_CFG_PLL1P_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL1P_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL1P_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1P_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL1Q_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL1Q_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL1Q_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1Q_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL1R_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL1R_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL1R_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1R_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL2P_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL2P_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL2P_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2P_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL2Q_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL2Q_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL2Q_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2Q_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL2R_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL2R_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL2R_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2R_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL3P_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL3P_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL3P_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3P_CLOCK_MODE value specified"
#endif

