chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL3Q_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3Q_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_PLL3R_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL3R_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_USART3_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USART3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_UART4_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_UART4_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_DISABLED) ||               \
     (STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_AUTO) ||                    \
     (STM32_CFG_UART5_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&                \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_UART5_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_LPUART1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPUART1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C3_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_I2C4_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_I2C4_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SPI1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SPI1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SPI2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SPI2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SPI3_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SPI3_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_FDCAN1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_FDCAN1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_SYSTICK_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SYSTICK_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                 \
     (STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_AUTO) ||                      \
     (STM32_CFG_USB_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_USB_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SDMMC1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_SDMMC1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_SDMMC1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SDMMC1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SDMMC2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_SDMMC2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_SDMMC2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SDMMC2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_OCTOSPI_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_OCTOSPI_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_OCTOSPI_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_OCTOSPI_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                 \
     (STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_AUTO) ||                      \
     (STM32_CFG_RNG_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_RNG_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SAI1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_SAI2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_SAI2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_SAI2_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SAI2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_MDF1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_MDF1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_MDF1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_MDF1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADF1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_ADCDAC_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_DAC1SH_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM1_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_DISABLED) ||              \
     (STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_AUTO) ||                   \
     (STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&               \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM2_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_DISABLED) ||             \
     (STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_AUTO) ||                  \
     (STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_ENABLED)) &&              \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LPTIM34_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_DISABLED) ||                \
     (STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_AUTO) ||                     \
     (STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_ENABLED)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_IWDG_CLOCK_MODE value specified"
#endif

#if !((STM32_CFG_PLL1P_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL1P_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL1P clock disabled but PLL1P clock is required"
#endif

