chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_CFG_PLL1Q_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL1Q_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL1Q clock disabled but PLL1Q clock is required"
#endif

#if !((STM32_CFG_PLL1R_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL1R_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL1R clock disabled but PLL1R clock is required"
#endif

#if !((STM32_CFG_PLL2P_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL2P_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL2P clock disabled but PLL2P clock is required"
#endif

#if !((STM32_CFG_PLL2Q_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL2Q_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL2Q clock disabled but PLL2Q clock is required"
#endif

#if !((STM32_CFG_PLL2R_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL2R_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL2R clock disabled but PLL2R clock is required"
#endif

#if !((STM32_CFG_PLL3P_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL3P_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL3P clock disabled but PLL3P clock is required"
#endif

#if !((STM32_CFG_PLL3Q_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL3Q_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL3Q clock disabled but PLL3Q clock is required"
#endif

#if !((STM32_CFG_PLL3R_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_PLL3R_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "PLL3R clock disabled but PLL3R clock is required"
#endif

#if !((STM32_CFG_USART1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART1 clock disabled but USART1 clock is required"
#endif

#if !((STM32_CFG_USART2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART2 clock disabled but USART2 clock is required"
#endif

#if !((STM32_CFG_USART3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_USART3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USART3 clock disabled but USART3 clock is required"
#endif

#if !((STM32_CFG_UART4_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_UART4_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "UART4 clock disabled but UART4 clock is required"
#endif

#if !((STM32_CFG_UART5_CLOCK_MODE != STM32_CLOCK_DISABLED) ||               \
     !defined(STM32_UART5_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "UART5 clock disabled but UART5 clock is required"
#endif

#if !((STM32_CFG_LPUART1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_LPUART1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "LPUART1 clock disabled but LPUART1 clock is required"
#endif

#if !((STM32_CFG_I2C1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C1 clock disabled but I2C1 clock is required"
#endif

#if !((STM32_CFG_I2C2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C2 clock disabled but I2C2 clock is required"
#endif

#if !((STM32_CFG_I2C3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C3 clock disabled but I2C3 clock is required"
#endif

#if !((STM32_CFG_I2C4_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_I2C4_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "I2C4 clock disabled but I2C4 clock is required"
#endif

#if !((STM32_CFG_SPI1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SPI1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SPI1 clock disabled but SPI1 clock is required"
#endif

#if !((STM32_CFG_SPI2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SPI2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SPI2 clock disabled but SPI2 clock is required"
#endif

#if !((STM32_CFG_SPI3_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SPI3_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SPI3 clock disabled but SPI3 clock is required"
#endif

#if !((STM32_CFG_FDCAN1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_FDCAN1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "FDCAN1 clock disabled but FDCAN1 clock is required"
#endif

#if !((STM32_CFG_SYSTICK_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_SYSTICK_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SYSTICK clock disabled but SYSTICK clock is required"
#endif

#if !((STM32_CFG_USB_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_USB_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "USB clock disabled but USB clock is required"
#endif

#if !((STM32_CFG_SDMMC1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_SDMMC1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SDMMC1 clock disabled but SDMMC1 clock is required"
#endif

#if !((STM32_CFG_SDMMC2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||              \
     !defined(STM32_SDMMC2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SDMMC2 clock disabled but SDMMC2 clock is required"
#endif

#if !((STM32_CFG_OCTOSPI_CLOCK_MODE != STM32_CLOCK_DISABLED) ||             \
     !defined(STM32_OCTOSPI_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "OCTOSPI clock disabled but OCTOSPI clock is required"
#endif

#if !((STM32_CFG_RNG_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                 \
     !defined(STM32_RNG_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "RNG clock disabled but RNG clock is required"
#endif

#if !((STM32_CFG_SAI1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SAI1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SAI1 clock disabled but SAI1 clock is required"
#endif

#if !((STM32_CFG_SAI2_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_SAI2_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "SAI2 clock disabled but SAI2 clock is required"
#endif

#if !((STM32_CFG_MDF1_CLOCK_MODE != STM32_CLOCK_DISABLED) ||                \
     !defined(STM32_MDF1_CLOCK_REQUIRED)) && !defined(__DOXYGEN__)
  #error "MDF1 clock disabled but MDF1 clock is required"
#endif

