chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/**
 * @brief   ADF1 sink demand state.
 */
#if ((STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_ADF1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_ADF1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_ADF1_DEMANDED               TRUE
#else
  #define STM32_ADF1_DEMANDED               FALSE
#endif

/**
 * @brief   ADCDAC sink demand state.
 */
#if ((STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_ADCDAC_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_ADCDAC_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_ADCDAC_DEMANDED             TRUE
#else
  #define STM32_ADCDAC_DEMANDED             FALSE
#endif

/**
 * @brief   DAC1SH sink demand state.
 */
#if ((STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_DAC1SH_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_DAC1SH_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_DAC1SH_DEMANDED             TRUE
#else
  #define STM32_DAC1SH_DEMANDED             FALSE
#endif

/**
 * @brief   LPTIM1 sink demand state.
 */
#if ((STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_LPTIM1_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_LPTIM1_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_LPTIM1_DEMANDED             TRUE
#else
  #define STM32_LPTIM1_DEMANDED             FALSE
#endif

/**
 * @brief   LPTIM2 sink demand state.
 */
#if ((STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                \
     ((STM32_CFG_LPTIM2_CLOCK_MODE == STM32_CLOCK_AUTO) &&                  \
      defined(STM32_LPTIM2_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_LPTIM2_DEMANDED             TRUE
#else
  #define STM32_LPTIM2_DEMANDED             FALSE
#endif

/**
 * @brief   LPTIM34 sink demand state.
 */
#if ((STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_ENABLED) ||               \
     ((STM32_CFG_LPTIM34_CLOCK_MODE == STM32_CLOCK_AUTO) &&                 \
      defined(STM32_LPTIM34_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_LPTIM34_DEMANDED            TRUE
#else
  #define STM32_LPTIM34_DEMANDED            FALSE
#endif

/**
 * @brief   IWDG sink demand state.
 */
#if ((STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_ENABLED) ||                  \
     ((STM32_CFG_IWDG_CLOCK_MODE == STM32_CLOCK_AUTO) &&                    \
      defined(STM32_IWDG_CLOCK_REQUIRED))) || defined(__DOXYGEN__)
  #define STM32_IWDG_DEMANDED               TRUE
#else
  #define STM32_IWDG_DEMANDED               FALSE
#endif
/** @} */

/**
 * @brief   NONE clock derived enable state.
 */
#define STM32_NONE_ENABLED                  FALSE

/**
 * @brief   AUDIOCLK clock derived enable state.
 */
#define STM32_AUDIOCLK_ENABLED              TRUE

/**
 * @brief   HSI16 clock derived enable state.
 */
#define STM32_HSI16_ENABLED                 STM32_CFG_HSI16_ENABLE

/**
 * @brief   HSI48 clock derived enable state.
 */
#define STM32_HSI48_ENABLED                 STM32_CFG_HSI48_ENABLE

/**
 * @brief   SHSI clock derived enable state.
 */
#define STM32_SHSI_ENABLED                  STM32_CFG_SHSI_ENABLE

/**
 * @brief   HSE clock derived enable state.
 */
#define STM32_HSE_ENABLED                   STM32_CFG_HSE_ENABLE

/**
 * @brief   LSE clock derived enable state.
 */
#define STM32_LSE_ENABLED                   STM32_CFG_LSE_ENABLE

/**
 * @brief   LSI clock derived enable state.
 */
#define STM32_LSI_ENABLED                   STM32_CFG_LSI_ENABLE

/**
 * @brief   MSIRC0 clock derived enable state.
 */
#define STM32_MSIRC0_ENABLED                (((STM32_MSISRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSISRC_SEL == RCC_ICSCR1_MSISRANGE_MSIRC0)) || \
                                             ((STM32_MSIKRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSIKRC_SEL == RCC_ICSCR1_MSIKRANGE_MSIRC0)))

/**
 * @brief   MSIRC1 clock derived enable state.
 */
#define STM32_MSIRC1_ENABLED                (((STM32_MSISRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSISRC_SEL == RCC_ICSCR1_MSISRANGE_MSIRC1)) || \
                                             ((STM32_MSIKRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSIKRC_SEL == RCC_ICSCR1_MSIKRANGE_MSIRC1)))

/**
 * @brief   MSIRC2 clock derived enable state.
 */
#define STM32_MSIRC2_ENABLED                (((STM32_MSISRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSISRC_SEL == RCC_ICSCR1_MSISRANGE_MSIRC2)) || \
                                             ((STM32_MSIKRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSIKRC_SEL == RCC_ICSCR1_MSIKRANGE_MSIRC2)))

/**
 * @brief   MSIRC3 clock derived enable state.
 */
#define STM32_MSIRC3_ENABLED                (((STM32_MSISRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSISRC_SEL == RCC_ICSCR1_MSISRANGE_MSIRC3)) || \
                                             ((STM32_MSIKRC_ENABLED == TRUE) && \
                                              (STM32_DCFG_MSIKRC_SEL == RCC_ICSCR1_MSIKRANGE_MSIRC3)))

/**
 * @brief   MSISRC clock derived enable state.
 */
#define STM32_MSISRC_ENABLED                ((STM32_MSISDIV_ENABLED == TRUE))

/**
 * @brief   MSISDIV clock derived enable state.
 */
#define STM32_MSISDIV_ENABLED               ((STM32_MSIS_ENABLED == TRUE))

/**
 * @brief   MSIS clock derived enable state.
 */
#define STM32_MSIS_ENABLED                  ((STM32_TIMICSEL_MSIS_SOURCE_DEMANDED == TRUE) || \
                                             ((STM32_PLL1IN_ENABLED == TRUE) && \
                                              (STM32_CFG_PLL1IN_SEL == RCC_PLL1CFGR_PLL1SRC_MSIS)) || \
                                             ((STM32_PLL2IN_ENABLED == TRUE) && \
                                              (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_MSIS)) || \
                                             ((STM32_PLL3IN_ENABLED == TRUE) && \
                                              (STM32_CFG_PLL3IN_SEL == RCC_PLL3CFGR_PLL3SRC_MSIS)) || \
                                             ((STM32_SYSCLK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_MSIS)) || \
                                             ((STM32_MCODIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_MSIS)))

/**
 * @brief   MSIKRC clock derived enable state.
 */
#define STM32_MSIKRC_ENABLED                ((STM32_MSIKDIV_ENABLED == TRUE))

/**
 * @brief   MSIKDIV clock derived enable state.
 */
#define STM32_MSIKDIV_ENABLED               ((STM32_MSIK_ENABLED == TRUE))

/**
 * @brief   MSIK clock derived enable state.
 */
#define STM32_MSIK_ENABLED                  ((STM32_TIMICSEL_MSIK_SOURCE_DEMANDED == TRUE) || \
                                             ((STM32_MCODIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_MSIK)) || \
                                             ((STM32_LPUART1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_MSIK)) || \
                                             ((STM32_I2C1_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C1_SEL == RCC_CCIPR1_I2C1SEL_MSIK)) || \
                                             ((STM32_I2C2_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)) || \
                                             ((STM32_I2C4_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_MSIK)) || \
                                             ((STM32_I2C3_ENABLED == TRUE) && \
                                              (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)) || \
                                             ((STM32_SPI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_MSIK)) || \
                                             ((STM32_SPI2_ENABLED == TRUE) && \
                                              (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_MSIK)) || \
                                             ((STM32_SPI3_ENABLED == TRUE) && \
                                              (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_MSIK)) || \
                                             ((STM32_ICLK_ENABLED == TRUE) && \
                                              (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_MSIK)) || \
                                             ((STM32_OCTOSPI_ENABLED == TRUE) && \
                                              (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_MSIK)) || \
                                             ((STM32_MDF1_ENABLED == TRUE) && \
                                              (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_MSIK)) || \
                                             ((STM32_ADF1_ENABLED == TRUE) && \
                                              (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_MSIK)) || \
                                             ((STM32_ADCDAC_ENABLED == TRUE) && \
                                              (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_MSIK)) || \
                                             ((STM32_LPTIM1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_MSIK)) || \
                                             ((STM32_LPTIM34_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_MSIK)))

/**
 * @brief   PLL1IN clock derived enable state.
 */
#define STM32_PLL1IN_ENABLED                ((STM32_PLL1REF_ENABLED == TRUE))

/**
 * @brief   PLL1REF clock derived enable state.
 */
#define STM32_PLL1REF_ENABLED               ((STM32_PLL1VCO_ENABLED == TRUE))

/**
 * @brief   PLL1VCO clock derived enable state.
 */
#define STM32_PLL1VCO_ENABLED               ((STM32_PLL1P_ENABLED == TRUE) || \
                                             (STM32_PLL1Q_ENABLED == TRUE) || \
                                             (STM32_PLL1R_ENABLED == TRUE))

/**
 * @brief   PLL1P clock derived enable state.
 */
#define STM32_PLL1P_ENABLED                 ((STM32_PLL1P_DEMANDED == TRUE) || \
                                             ((STM32_SDMMC_ENABLED == TRUE) && \
                                              (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_PLL1P)) || \
                                             ((STM32_SAI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL1P)) || \
                                             ((STM32_SAI2_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL1P)) || \
                                             ((STM32_MDF1_ENABLED == TRUE) && \
                                              (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL1P)) || \
                                             ((STM32_ADF1_ENABLED == TRUE) && \
                                              (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL1P)))

/**
 * @brief   PLL1Q clock derived enable state.
 */
#define STM32_PLL1Q_ENABLED                 ((STM32_PLL1Q_DEMANDED == TRUE) || \
                                             ((STM32_FDCAN1_ENABLED == TRUE) && \
                                              (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_PLL1Q)) || \
                                             ((STM32_ICLK_ENABLED == TRUE) && \
                                              (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_PLL1Q)) || \
                                             ((STM32_OCTOSPI_ENABLED == TRUE) && \
                                              (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL1Q)))

/**
 * @brief   PLL1R clock derived enable state.
 */
#define STM32_PLL1R_ENABLED                 ((STM32_PLL1R_DEMANDED == TRUE) || \
                                             ((STM32_SYSCLK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_PLL1R)) || \
                                             ((STM32_MCODIV_ENABLED == TRUE) && \
                                              (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_PLL1R)))

/**
 * @brief   PLL2IN clock derived enable state.
 */
#define STM32_PLL2IN_ENABLED                ((STM32_PLL2REF_ENABLED == TRUE))

/**
 * @brief   PLL2REF clock derived enable state.
 */
#define STM32_PLL2REF_ENABLED               ((STM32_PLL2VCO_ENABLED == TRUE))

/**
 * @brief   PLL2VCO clock derived enable state.
 */
#define STM32_PLL2VCO_ENABLED               ((STM32_PLL2P_ENABLED == TRUE) || \
                                             (STM32_PLL2Q_ENABLED == TRUE) || \
                                             (STM32_PLL2R_ENABLED == TRUE))

/**
 * @brief   PLL2P clock derived enable state.
 */
#define STM32_PLL2P_ENABLED                 ((STM32_PLL2P_DEMANDED == TRUE) || \
                                             ((STM32_FDCAN1_ENABLED == TRUE) && \
                                              (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCANSEL_PLL2P)) || \
                                             ((STM32_SAI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL2P)) || \
                                             ((STM32_SAI2_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL2P)))

/**
 * @brief   PLL2Q clock derived enable state.
 */
#define STM32_PLL2Q_ENABLED                 ((STM32_PLL2Q_DEMANDED == TRUE) || \
                                             ((STM32_ICLK_ENABLED == TRUE) && \
                                              (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_PLL2Q)) || \
                                             ((STM32_OCTOSPI_ENABLED == TRUE) && \
                                              (STM32_CFG_OCTOSPI_SEL == RCC_CCIPR2_OCTOSPISEL_PLL2Q)))

/**
 * @brief   PLL2R clock derived enable state.
 */
#define STM32_PLL2R_ENABLED                 ((STM32_PLL2R_DEMANDED == TRUE) || \
                                             ((STM32_ADCDAC_ENABLED == TRUE) && \
                                              (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_PLL2R)))

/**
 * @brief   PLL3IN clock derived enable state.
 */
#define STM32_PLL3IN_ENABLED                ((STM32_PLL3REF_ENABLED == TRUE))

/**
 * @brief   PLL3REF clock derived enable state.
 */
#define STM32_PLL3REF_ENABLED               ((STM32_PLL3VCO_ENABLED == TRUE))

/**
 * @brief   PLL3VCO clock derived enable state.
 */
#define STM32_PLL3VCO_ENABLED               ((STM32_PLL3P_ENABLED == TRUE) || \
                                             (STM32_PLL3Q_ENABLED == TRUE) || \
                                             (STM32_PLL3R_ENABLED == TRUE))

/**
 * @brief   PLL3P clock derived enable state.
 */
#define STM32_PLL3P_ENABLED                 ((STM32_PLL3P_DEMANDED == TRUE) || \
                                             ((STM32_SAI1_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_PLL3P)) || \
                                             ((STM32_SAI2_ENABLED == TRUE) && \
                                              (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_PLL3P)))

/**
 * @brief   PLL3Q clock derived enable state.
 */
#define STM32_PLL3Q_ENABLED                 ((STM32_PLL3Q_DEMANDED == TRUE) || \
                                             ((STM32_MDF1_ENABLED == TRUE) && \
                                              (STM32_CFG_MDF1_SEL == RCC_CCIPR2_MDF1SEL_PLL3Q)) || \
                                             ((STM32_ADF1_ENABLED == TRUE) && \
                                              (STM32_CFG_ADF1_SEL == RCC_CCIPR3_ADF1SEL_PLL3Q)))

/**
 * @brief   PLL3R clock derived enable state.
 */
#define STM32_PLL3R_ENABLED                 ((STM32_PLL3R_DEMANDED == TRUE))

/**
 * @brief   SYSCLK clock derived enable state.
 */
#define STM32_SYSCLK_ENABLED                TRUE

/**
 * @brief   HCLK clock derived enable state.
 */
#define STM32_HCLK_ENABLED                  TRUE

/**
 * @brief   PCLK1 clock derived enable state.
 */
#define STM32_PCLK1_ENABLED                 TRUE

/**
 * @brief   PCLK1TIM clock derived enable state.
 */
#define STM32_PCLK1TIM_ENABLED              TRUE

/**
 * @brief   PCLK2 clock derived enable state.
 */
#define STM32_PCLK2_ENABLED                 TRUE

/**
 * @brief   PCLK2TIM clock derived enable state.
 */
#define STM32_PCLK2TIM_ENABLED              TRUE

/**
 * @brief   PCLK3 clock derived enable state.
 */
#define STM32_PCLK3_ENABLED                 TRUE

/**
 * @brief   HSEDIV clock derived enable state.
 */
#define STM32_HSEDIV_ENABLED                (((STM32_RTC_ENABLED == TRUE) && \
                                              (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_HSEDIV)))

/**
 * @brief   MCODIV clock derived enable state.
 */
#define STM32_MCODIV_ENABLED                TRUE

/**
 * @brief   MCO clock derived enable state.
 */
#define STM32_MCO_ENABLED                   TRUE

/**
 * @brief   LSESYS clock derived enable state.
 */
#define STM32_LSESYS_ENABLED                (((STM32_LSCO_ENABLED == TRUE) && \
                                              (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE)) || \
                                             ((STM32_USART1_ENABLED == TRUE) && \
                                              (STM32_CFG_USART1_SEL == RCC_CCIPR1_USART1SEL_LSE)) || \
                                             ((STM32_USART2_ENABLED == TRUE) && \
                                              (STM32_CFG_USART2_SEL == RCC_CCIPR1_USART2SEL_LSE)) || \
                                             ((STM32_USART3_ENABLED == TRUE) && \
                                              (STM32_CFG_USART3_SEL == RCC_CCIPR1_USART3SEL_LSE)) || \
                                             ((STM32_UART4_ENABLED == TRUE) && \
                                              (STM32_CFG_UART4_SEL == RCC_CCIPR1_UART4SEL_LSE)) || \
                                             ((STM32_UART5_ENABLED == TRUE) && \
                                              (STM32_CFG_UART5_SEL == RCC_CCIPR1_UART5SEL_LSE)) || \
                                             ((STM32_LPUART1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_LSE)) || \
                                             ((STM32_SYSTICK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE)) || \
                                             ((STM32_DAC1SH_ENABLED == TRUE) && \
                                              (STM32_CFG_DAC1SH_SEL == RCC_CCIPR3_DAC1SEL_LSE)) || \
                                             ((STM32_LPTIM1_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSE)) || \
                                             ((STM32_LPTIM2_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSE)) || \
                                             ((STM32_LPTIM34_ENABLED == TRUE) && \
                                              (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSE)))

/**
 * @brief   RTC clock derived enable state.
 */
#define STM32_RTC_ENABLED                   TRUE

/**
 * @brief   LSCO clock derived enable state.
 */
#define STM32_LSCO_ENABLED                  TRUE

/**
 * @brief   USART1 clock derived enable state.
 */
#define STM32_USART1_ENABLED                ((STM32_USART1_DEMANDED == TRUE))

/**
 * @brief   USART2 clock derived enable state.
 */
#define STM32_USART2_ENABLED                ((STM32_USART2_DEMANDED == TRUE))

/**
 * @brief   USART3 clock derived enable state.
 */
#define STM32_USART3_ENABLED                ((STM32_USART3_DEMANDED == TRUE))

/**
 * @brief   UART4 clock derived enable state.
 */
#define STM32_UART4_ENABLED                 ((STM32_UART4_DEMANDED == TRUE))

/**
 * @brief   UART5 clock derived enable state.
 */
#define STM32_UART5_ENABLED                 ((STM32_UART5_DEMANDED == TRUE))

/**
 * @brief   LPUART1 clock derived enable state.
 */
#define STM32_LPUART1_ENABLED               ((STM32_LPUART1_DEMANDED == TRUE))

/**
 * @brief   I2C1 clock derived enable state.
 */
#define STM32_I2C1_ENABLED                  ((STM32_I2C1_DEMANDED == TRUE))

/**
 * @brief   I2C2 clock derived enable state.
 */
#define STM32_I2C2_ENABLED                  ((STM32_I2C2_DEMANDED == TRUE))

/**
 * @brief   I2C4 clock derived enable state.
 */
#define STM32_I2C4_ENABLED                  ((STM32_I2C4_DEMANDED == TRUE))

/**
 * @brief   I2C3 clock derived enable state.
 */
#define STM32_I2C3_ENABLED                  ((STM32_I2C3_DEMANDED == TRUE))

/**
 * @brief   SPI1 clock derived enable state.
 */
#define STM32_SPI1_ENABLED                  ((STM32_SPI1_DEMANDED == TRUE))

/**
 * @brief   SPI2 clock derived enable state.
 */
#define STM32_SPI2_ENABLED                  ((STM32_SPI2_DEMANDED == TRUE))

/**
 * @brief   SPI3 clock derived enable state.
 */
#define STM32_SPI3_ENABLED                  ((STM32_SPI3_DEMANDED == TRUE))

/**
 * @brief   FDCAN1 clock derived enable state.
 */
#define STM32_FDCAN1_ENABLED                ((STM32_FDCAN1_DEMANDED == TRUE))

/**
 * @brief   HCLKDIV8 clock derived enable state.
 */
#define STM32_HCLKDIV8_ENABLED              (((STM32_SYSTICK_ENABLED == TRUE) && \
                                              (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_HCLKDIV8)))

/**
 * @brief   SYSTICK clock derived enable state.
 */
#define STM32_SYSTICK_ENABLED               ((STM32_SYSTICK_DEMANDED == TRUE))

/**
 * @brief   TIM16IC clock derived enable state.
 */
#define STM32_TIM16IC_ENABLED               TRUE

/**
 * @brief   TIM17IC clock derived enable state.
 */
#define STM32_TIM17IC_ENABLED               TRUE

/**
 * @brief   LPTIM2IC clock derived enable state.
 */
#define STM32_LPTIM2IC_ENABLED              TRUE

/**
 * @brief   ICLK clock derived enable state.
 */
#define STM32_ICLK_ENABLED                  ((STM32_USB_ENABLED == TRUE) || \
                                             ((STM32_SDMMC_ENABLED == TRUE) && \
                                              (STM32_CFG_SDMMC_SEL == RCC_CCIPR2_SDMMCSEL_ICLK)))

/**
 * @brief   USB clock derived enable state.
 */
#define STM32_USB_ENABLED                   ((STM32_USB_DEMANDED == TRUE))

/**
 * @brief   SDMMC clock derived enable state.
 */
#define STM32_SDMMC_ENABLED                 ((STM32_SDMMC1_ENABLED == TRUE) || \
                                             (STM32_SDMMC2_ENABLED == TRUE))

/**
 * @brief   SDMMC1 clock derived enable state.
 */
#define STM32_SDMMC1_ENABLED                ((STM32_SDMMC1_DEMANDED == TRUE))

/**
 * @brief   SDMMC2 clock derived enable state.
 */
#define STM32_SDMMC2_ENABLED                ((STM32_SDMMC2_DEMANDED == TRUE))

/**
 * @brief   OCTOSPI clock derived enable state.
 */
#define STM32_OCTOSPI_ENABLED               ((STM32_OCTOSPI_DEMANDED == TRUE))

