chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C4_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C4"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_I2C3_ENABLED == TRUE) &&    \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by I2C3"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SPI1_ENABLED == TRUE) &&    \
      (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SPI1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SPI2_ENABLED == TRUE) &&    \
      (STM32_CFG_SPI2_SEL == RCC_CCIPR1_SPI2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SPI2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SPI3_ENABLED == TRUE) &&    \
      (STM32_CFG_SPI3_SEL == RCC_CCIPR3_SPI3SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SPI3"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_RNG_ENABLED == TRUE) &&     \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by RNG"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SAI1_ENABLED == TRUE) &&    \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SAI1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_SAI2_ENABLED == TRUE) &&    \
      (STM32_CFG_SAI2_SEL == RCC_CCIPR2_SAI2SEL_HSI16))) && !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by SAI2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_ADCDAC_ENABLED == TRUE) &&  \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR3_ADCDACSEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by ADCDAC"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&  \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM1"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM2_ENABLED == TRUE) &&  \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_HSI16))) &&             \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM2"
#endif

#if !((STM32_HSI16_ENABLED == TRUE) || !((STM32_LPTIM34_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_HSI16))) &&           \
    !defined(__DOXYGEN__)
  #error "HSI16 not enabled, required by LPTIM34"
#endif

/**
 * @brief   HSI16 nominal source frequency.
 */
#define STM32_HSI16_SOURCE_FREQ             16000000U

/**
 * @brief   HSI16 clock register bits.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_HSI16_BITS               (RCC_CR_HSION | RCC_CR_HSIKERON)
#else
  #define STM32_CR_HSI16_BITS               0U
#endif

/**
 * @brief   16 MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI16_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI16_FREQ                  STM32_HSI16_SOURCE_FREQ
#else
  #define STM32_HSI16_FREQ                  0U
#endif
#define STM32_HSI16_CLOCK                   hal_lld_get_clock_point(CLK_HSI16)

/* --- Macros and checks for the HSI48 clock point. ------------------------*/

#if !((STM32_CFG_HSI48_ENABLE == TRUE) || (STM32_CFG_HSI48_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSI48_ENABLE value specified"
#endif

#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_MCODIV_ENABLED == TRUE) &&  \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by MCODIV"
#endif

#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_ICLK_ENABLED == TRUE) &&    \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by ICLK"
#endif

#if !defined(STM32_HSI48DIV2_ENABLED) && !defined(__DOXYGEN__)
  #error "STM32_HSI48DIV2_ENABLED not defined"
#endif
#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_HSI48DIV2_ENABLED == TRUE))) && \
    !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by HSI48DIV2"
#endif

#if !((STM32_HSI48_ENABLED == TRUE) || !((STM32_RNG_ENABLED == TRUE) &&     \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48))) && !defined(__DOXYGEN__)
  #error "HSI48 not enabled, required by RNG"
#endif

/**
 * @brief   HSI48 nominal source frequency.
 */
#define STM32_HSI48_SOURCE_FREQ             48000000U

/**
 * @brief   HSI48 clock register bits.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_HSI48_BITS               RCC_CR_HSI48ON
#else
  #define STM32_CR_HSI48_BITS               0U
#endif

/**
 * @brief   48 MHz high speed internal oscillator clock point.
 */
#if (STM32_HSI48_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSI48_FREQ                  STM32_HSI48_SOURCE_FREQ
#else
  #define STM32_HSI48_FREQ                  0U
#endif
#define STM32_HSI48_CLOCK                   hal_lld_get_clock_point(CLK_HSI48)

/* --- Macros and checks for the SHSI clock point. -------------------------*/

#if !((STM32_CFG_SHSI_ENABLE == TRUE) || (STM32_CFG_SHSI_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_SHSI_ENABLE value specified"
#endif

/**
 * @brief   SHSI nominal source frequency.
 */
#define STM32_SHSI_SOURCE_FREQ              48000000U

/**
 * @brief   SHSI clock register bits.
 */
#if (STM32_SHSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_CR_SHSI_BITS                RCC_CR_SHSION
#else
  #define STM32_CR_SHSI_BITS                0U
#endif

/**
 * @brief   48 MHz secure high speed internal oscillator clock point.
 */
#if (STM32_SHSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_SHSI_FREQ                   STM32_SHSI_SOURCE_FREQ
#else
  #define STM32_SHSI_FREQ                   0U
#endif
#define STM32_SHSI_CLOCK                    hal_lld_get_clock_point(CLK_SHSI)

/* --- Macros and checks for the HSE clock point. --------------------------*/

#if !((STM32_CFG_HSE_ENABLE == TRUE) || (STM32_CFG_HSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_HSE_ENABLE value specified"
#endif

#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_PLL1IN_ENABLED == TRUE) &&    \
      (STM32_CFG_PLL1IN_SEL == RCC_PLL1CFGR_PLL1SRC_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by PLL1IN"
#endif

#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_PLL2IN_ENABLED == TRUE) &&    \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by PLL2IN"
#endif

