chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the PLL1REF clock point. ----------------------*/

#if !((STM32_CFG_PLL1REF_VALUE >= 1) && (STM32_CFG_PLL1REF_VALUE <= 16)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1REF_VALUE value specified"
#endif

/**
 * @brief   PLL1REF clock register bits.
 */
#if (STM32_PLL1REF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1REF_BITS                ((STM32_CFG_PLL1REF_VALUE - 1U) << RCC_PLL1CFGR_PLL1M_Pos) | (((STM32_PLL1REF_FREQ) > 8000000U) ? RCC_PLL1CFGR_PLL1RGE_8TO16 : \
                                             RCC_PLL1CFGR_PLL1RGE_4TO8)
#else
  #define STM32_PLL1REF_BITS                0U
#endif

/**
 * @brief   PLL1 reference clock point.
 */
#if (STM32_PLL1REF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1REF_FREQ                (STM32_PLL1IN_FREQ /            \
                                             STM32_CFG_PLL1REF_VALUE)
  #define STM32_PLL1REF_CLOCK               (STM32_PLL1IN_CLOCK /           \
                                             STM32_CFG_PLL1REF_VALUE)
#else
  #define STM32_PLL1REF_FREQ                0U
  #define STM32_PLL1REF_CLOCK               0U
#endif

#if !((STM32_PLL1REF_ENABLED != TRUE) ||                                    \
     (STM32_PLL1REF_FREQ >= STM32_PLLIN_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLL1REF_FREQ below minimum frequency"
#endif

#if !((STM32_PLL1REF_ENABLED != TRUE) ||                                    \
     (STM32_PLL1REF_FREQ <= STM32_PLLIN_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLL1REF_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL1VCO clock point. ----------------------*/

#if !((STM32_CFG_PLL1VCO_VALUE >= 4) && (STM32_CFG_PLL1VCO_VALUE <= 136)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1VCO_VALUE value specified"
#endif

/**
 * @brief   PLL1VCO clock register bits.
 */
#if (STM32_PLL1VCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1VCO_BITS                ((STM32_CFG_PLL1VCO_VALUE -     \
                                              1U) << RCC_PLL1DIVR_PLL1N_Pos)
#else
  #define STM32_PLL1VCO_BITS                0U
#endif

/**
 * @brief   PLL1 VCO clock point.
 */
#if (STM32_PLL1VCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1VCO_FREQ                (STM32_PLL1REF_FREQ *           \
                                             STM32_CFG_PLL1VCO_VALUE)
  #define STM32_PLL1VCO_CLOCK               (STM32_PLL1REF_CLOCK *          \
                                             STM32_CFG_PLL1VCO_VALUE)
#else
  #define STM32_PLL1VCO_FREQ                0U
  #define STM32_PLL1VCO_CLOCK               0U
#endif

#if !((STM32_PLL1VCO_ENABLED != TRUE) ||                                    \
     (STM32_PLL1VCO_FREQ >= STM32_PLLVCO_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLL1VCO_FREQ below minimum frequency"
#endif

#if !((STM32_PLL1VCO_ENABLED != TRUE) ||                                    \
     (STM32_PLL1VCO_FREQ <= STM32_PLLVCO_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLL1VCO_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL1P clock point. ------------------------*/

#if !((STM32_CFG_PLL1P_VALUE >= 1) && (STM32_CFG_PLL1P_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1P_VALUE value specified"
#endif

/**
 * @brief   PLL1P clock register bits.
 */
#if (STM32_PLL1P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1P_BITS                  ((STM32_CFG_PLL1P_VALUE -       \
                                              1U) << RCC_PLL1DIVR_PLL1P_Pos)
#else
  #define STM32_PLL1P_BITS                  0U
#endif

/**
 * @brief   PLL1 P output clock point.
 */
#if (STM32_PLL1P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1P_FREQ                  (STM32_PLL1VCO_FREQ /           \
                                             STM32_CFG_PLL1P_VALUE)
#else
  #define STM32_PLL1P_FREQ                  0U
#endif
#define STM32_PLL1P_CLOCK                   hal_lld_get_clock_point(CLK_PLL1P)

#if !((STM32_PLL1P_ENABLED != TRUE) || (STM32_PLL1P_FREQ >= STM32_PLLP_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL1P_FREQ below minimum frequency"
#endif

#if !((STM32_PLL1P_ENABLED != TRUE) || (STM32_PLL1P_FREQ <= STM32_PLLP_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL1P_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL1Q clock point. ------------------------*/

#if !((STM32_CFG_PLL1Q_VALUE >= 1) && (STM32_CFG_PLL1Q_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1Q_VALUE value specified"
#endif

/**
 * @brief   PLL1Q clock register bits.
 */
#if (STM32_PLL1Q_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1Q_BITS                  ((STM32_CFG_PLL1Q_VALUE -       \
                                              1U) << RCC_PLL1DIVR_PLL1Q_Pos)
#else
  #define STM32_PLL1Q_BITS                  0U
#endif

/**
 * @brief   PLL1 Q output clock point.
 */
#if (STM32_PLL1Q_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1Q_FREQ                  (STM32_PLL1VCO_FREQ /           \
                                             STM32_CFG_PLL1Q_VALUE)
#else
  #define STM32_PLL1Q_FREQ                  0U
#endif
#define STM32_PLL1Q_CLOCK                   hal_lld_get_clock_point(CLK_PLL1Q)

#if !((STM32_PLL1Q_ENABLED != TRUE) || (STM32_PLL1Q_FREQ >= STM32_PLLQ_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL1Q_FREQ below minimum frequency"
#endif

#if !((STM32_PLL1Q_ENABLED != TRUE) || (STM32_PLL1Q_FREQ <= STM32_PLLQ_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL1Q_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL1R clock point. ------------------------*/

#if !((STM32_CFG_PLL1R_VALUE == 1) || (STM32_CFG_PLL1R_VALUE == 2) ||       \
     (STM32_CFG_PLL1R_VALUE == 4) || (STM32_CFG_PLL1R_VALUE == 6) ||        \
     (STM32_CFG_PLL1R_VALUE == 8) || (STM32_CFG_PLL1R_VALUE == 10) ||       \
     (STM32_CFG_PLL1R_VALUE == 12) || (STM32_CFG_PLL1R_VALUE == 14) ||      \
     (STM32_CFG_PLL1R_VALUE == 16) || (STM32_CFG_PLL1R_VALUE == 18) ||      \
     (STM32_CFG_PLL1R_VALUE == 20) || (STM32_CFG_PLL1R_VALUE == 22) ||      \
     (STM32_CFG_PLL1R_VALUE == 24) || (STM32_CFG_PLL1R_VALUE == 26) ||      \
     (STM32_CFG_PLL1R_VALUE == 28) || (STM32_CFG_PLL1R_VALUE == 30) ||      \
     (STM32_CFG_PLL1R_VALUE == 32) || (STM32_CFG_PLL1R_VALUE == 34) ||      \
     (STM32_CFG_PLL1R_VALUE == 36) || (STM32_CFG_PLL1R_VALUE == 38) ||      \
     (STM32_CFG_PLL1R_VALUE == 40) || (STM32_CFG_PLL1R_VALUE == 42) ||      \
     (STM32_CFG_PLL1R_VALUE == 44) || (STM32_CFG_PLL1R_VALUE == 46) ||      \
     (STM32_CFG_PLL1R_VALUE == 48) || (STM32_CFG_PLL1R_VALUE == 50) ||      \
     (STM32_CFG_PLL1R_VALUE == 52) || (STM32_CFG_PLL1R_VALUE == 54) ||      \
     (STM32_CFG_PLL1R_VALUE == 56) || (STM32_CFG_PLL1R_VALUE == 58) ||      \
     (STM32_CFG_PLL1R_VALUE == 60) || (STM32_CFG_PLL1R_VALUE == 62) ||      \
     (STM32_CFG_PLL1R_VALUE == 64) || (STM32_CFG_PLL1R_VALUE == 66) ||      \
     (STM32_CFG_PLL1R_VALUE == 68) || (STM32_CFG_PLL1R_VALUE == 70) ||      \
     (STM32_CFG_PLL1R_VALUE == 72) || (STM32_CFG_PLL1R_VALUE == 74) ||      \
     (STM32_CFG_PLL1R_VALUE == 76) || (STM32_CFG_PLL1R_VALUE == 78) ||      \
     (STM32_CFG_PLL1R_VALUE == 80) || (STM32_CFG_PLL1R_VALUE == 82) ||      \
     (STM32_CFG_PLL1R_VALUE == 84) || (STM32_CFG_PLL1R_VALUE == 86) ||      \
     (STM32_CFG_PLL1R_VALUE == 88) || (STM32_CFG_PLL1R_VALUE == 90) ||      \
     (STM32_CFG_PLL1R_VALUE == 92) || (STM32_CFG_PLL1R_VALUE == 94) ||      \
     (STM32_CFG_PLL1R_VALUE == 96) || (STM32_CFG_PLL1R_VALUE == 98) ||      \
     (STM32_CFG_PLL1R_VALUE == 100) || (STM32_CFG_PLL1R_VALUE == 102) ||    \
     (STM32_CFG_PLL1R_VALUE == 104) || (STM32_CFG_PLL1R_VALUE == 106) ||    \
     (STM32_CFG_PLL1R_VALUE == 108) || (STM32_CFG_PLL1R_VALUE == 110) ||    \
     (STM32_CFG_PLL1R_VALUE == 112) || (STM32_CFG_PLL1R_VALUE == 114) ||    \
     (STM32_CFG_PLL1R_VALUE == 116) || (STM32_CFG_PLL1R_VALUE == 118) ||    \
     (STM32_CFG_PLL1R_VALUE == 120) || (STM32_CFG_PLL1R_VALUE == 122) ||    \
     (STM32_CFG_PLL1R_VALUE == 124) || (STM32_CFG_PLL1R_VALUE == 126) ||    \
     (STM32_CFG_PLL1R_VALUE == 128)) && !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL1R_VALUE value specified"
#endif

/**
 * @brief   PLL1R clock register bits.
 */
#if (STM32_PLL1R_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1R_BITS                  ((STM32_CFG_PLL1R_VALUE -       \
                                              1U) << RCC_PLL1DIVR_PLL1R_Pos)
#else
  #define STM32_PLL1R_BITS                  0U
#endif

/**
 * @brief   PLL1 R output clock point.
 */
#if (STM32_PLL1R_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL1R_FREQ                  (STM32_PLL1VCO_FREQ /           \
                                             STM32_CFG_PLL1R_VALUE)
#else
  #define STM32_PLL1R_FREQ                  0U
#endif
#define STM32_PLL1R_CLOCK                   hal_lld_get_clock_point(CLK_PLL1R)

