chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
#if !((STM32_PLL1R_ENABLED != TRUE) || (STM32_PLL1R_FREQ >= STM32_PLLR_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL1R_FREQ below minimum frequency"
#endif

#if !((STM32_PLL1R_ENABLED != TRUE) || (STM32_PLL1R_FREQ <= STM32_PLLR_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL1R_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL2IN clock point. -----------------------*/

/**
 * @brief   PLL2IN clock register bits.
 */
#if (STM32_PLL2IN_ENABLED == FALSE)
  #define STM32_PLL2IN_BITS                 RCC_PLL2CFGR_PLL2SRC_NOCLOCK
#elif (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_NOCLOCK) ||             \
      defined(__DOXYGEN__)
  #if (STM32_PLL2IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL2IN_BITS               RCC_PLL2CFGR_PLL2SRC_NOCLOCK
  #else
    #define STM32_PLL2IN_BITS               0U
  #endif
#elif (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_MSIS)
  #if (STM32_PLL2IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL2IN_BITS               RCC_PLL2CFGR_PLL2SRC_MSIS
  #else
    #define STM32_PLL2IN_BITS               0U
  #endif
#elif (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSI16)
  #if (STM32_PLL2IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL2IN_BITS               RCC_PLL2CFGR_PLL2SRC_HSI16
  #else
    #define STM32_PLL2IN_BITS               0U
  #endif
#elif (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSE)
  #if (STM32_PLL2IN_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_PLL2IN_BITS               RCC_PLL2CFGR_PLL2SRC_HSE
  #else
    #define STM32_PLL2IN_BITS               0U
  #endif
#else
  #error "invalid STM32_CFG_PLL2IN_SEL value specified"
#endif

/**
 * @brief   PLL2 input clock point.
 */
#if ((STM32_PLL2IN_ENABLED == TRUE) && \
     (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_PLL2IN_FREQ                 STM32_NONE_FREQ
  #define STM32_PLL2IN_CLOCK                STM32_NONE_CLOCK
#elif (STM32_PLL2IN_ENABLED == TRUE) && \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_MSIS)
  #define STM32_PLL2IN_FREQ                 STM32_MSIS_FREQ
  #define STM32_PLL2IN_CLOCK                STM32_MSIS_CLOCK
#elif (STM32_PLL2IN_ENABLED == TRUE) && \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSI16)
  #define STM32_PLL2IN_FREQ                 STM32_HSI16_FREQ
  #define STM32_PLL2IN_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_PLL2IN_ENABLED == TRUE) && \
      (STM32_CFG_PLL2IN_SEL == RCC_PLL2CFGR_PLL2SRC_HSE)
  #define STM32_PLL2IN_FREQ                 STM32_HSE_FREQ
  #define STM32_PLL2IN_CLOCK                STM32_HSE_CLOCK
#else
  #define STM32_PLL2IN_FREQ                 0U
  #define STM32_PLL2IN_CLOCK                0U
#endif

/* --- Macros and checks for the PLL2REF clock point. ----------------------*/

#if !((STM32_CFG_PLL2REF_VALUE >= 1) && (STM32_CFG_PLL2REF_VALUE <= 16)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2REF_VALUE value specified"
#endif

/**
 * @brief   PLL2REF clock register bits.
 */
#if (STM32_PLL2REF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2REF_BITS                ((STM32_CFG_PLL2REF_VALUE - 1U) << RCC_PLL2CFGR_PLL2M_Pos) | (((STM32_PLL2REF_FREQ) > 8000000U) ? RCC_PLL2CFGR_PLL2RGE_8TO16 : \
                                             RCC_PLL2CFGR_PLL2RGE_4TO8)
#else
  #define STM32_PLL2REF_BITS                0U
#endif

/**
 * @brief   PLL2 reference clock point.
 */
#if (STM32_PLL2REF_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2REF_FREQ                (STM32_PLL2IN_FREQ /            \
                                             STM32_CFG_PLL2REF_VALUE)
  #define STM32_PLL2REF_CLOCK               (STM32_PLL2IN_CLOCK /           \
                                             STM32_CFG_PLL2REF_VALUE)
#else
  #define STM32_PLL2REF_FREQ                0U
  #define STM32_PLL2REF_CLOCK               0U
#endif

#if !((STM32_PLL2REF_ENABLED != TRUE) ||                                    \
     (STM32_PLL2REF_FREQ >= STM32_PLLIN_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLL2REF_FREQ below minimum frequency"
#endif

#if !((STM32_PLL2REF_ENABLED != TRUE) ||                                    \
     (STM32_PLL2REF_FREQ <= STM32_PLLIN_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLL2REF_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL2VCO clock point. ----------------------*/

#if !((STM32_CFG_PLL2VCO_VALUE >= 4) && (STM32_CFG_PLL2VCO_VALUE <= 136)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2VCO_VALUE value specified"
#endif

/**
 * @brief   PLL2VCO clock register bits.
 */
#if (STM32_PLL2VCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2VCO_BITS                ((STM32_CFG_PLL2VCO_VALUE -     \
                                              1U) << RCC_PLL2DIVR_PLL2N_Pos)
#else
  #define STM32_PLL2VCO_BITS                0U
#endif

/**
 * @brief   PLL2 VCO clock point.
 */
#if (STM32_PLL2VCO_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2VCO_FREQ                (STM32_PLL2REF_FREQ *           \
                                             STM32_CFG_PLL2VCO_VALUE)
  #define STM32_PLL2VCO_CLOCK               (STM32_PLL2REF_CLOCK *          \
                                             STM32_CFG_PLL2VCO_VALUE)
#else
  #define STM32_PLL2VCO_FREQ                0U
  #define STM32_PLL2VCO_CLOCK               0U
#endif

#if !((STM32_PLL2VCO_ENABLED != TRUE) ||                                    \
     (STM32_PLL2VCO_FREQ >= STM32_PLLVCO_MIN)) && !defined(__DOXYGEN__)
  #error "STM32_PLL2VCO_FREQ below minimum frequency"
#endif

#if !((STM32_PLL2VCO_ENABLED != TRUE) ||                                    \
     (STM32_PLL2VCO_FREQ <= STM32_PLLVCO_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_PLL2VCO_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL2P clock point. ------------------------*/

#if !((STM32_CFG_PLL2P_VALUE >= 1) && (STM32_CFG_PLL2P_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2P_VALUE value specified"
#endif

/**
 * @brief   PLL2P clock register bits.
 */
#if (STM32_PLL2P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2P_BITS                  ((STM32_CFG_PLL2P_VALUE -       \
                                              1U) << RCC_PLL2DIVR_PLL2P_Pos)
#else
  #define STM32_PLL2P_BITS                  0U
#endif

/**
 * @brief   PLL2 P output clock point.
 */
#if (STM32_PLL2P_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2P_FREQ                  (STM32_PLL2VCO_FREQ /           \
                                             STM32_CFG_PLL2P_VALUE)
#else
  #define STM32_PLL2P_FREQ                  0U
#endif
#define STM32_PLL2P_CLOCK                   hal_lld_get_clock_point(CLK_PLL2P)

#if !((STM32_PLL2P_ENABLED != TRUE) || (STM32_PLL2P_FREQ >= STM32_PLLP_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL2P_FREQ below minimum frequency"
#endif

#if !((STM32_PLL2P_ENABLED != TRUE) || (STM32_PLL2P_FREQ <= STM32_PLLP_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL2P_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL2Q clock point. ------------------------*/

#if !((STM32_CFG_PLL2Q_VALUE >= 1) && (STM32_CFG_PLL2Q_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2Q_VALUE value specified"
#endif

/**
 * @brief   PLL2Q clock register bits.
 */
#if (STM32_PLL2Q_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2Q_BITS                  ((STM32_CFG_PLL2Q_VALUE -       \
                                              1U) << RCC_PLL2DIVR_PLL2Q_Pos)
#else
  #define STM32_PLL2Q_BITS                  0U
#endif

/**
 * @brief   PLL2 Q output clock point.
 */
#if (STM32_PLL2Q_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2Q_FREQ                  (STM32_PLL2VCO_FREQ /           \
                                             STM32_CFG_PLL2Q_VALUE)
#else
  #define STM32_PLL2Q_FREQ                  0U
#endif
#define STM32_PLL2Q_CLOCK                   hal_lld_get_clock_point(CLK_PLL2Q)

#if !((STM32_PLL2Q_ENABLED != TRUE) || (STM32_PLL2Q_FREQ >= STM32_PLLQ_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL2Q_FREQ below minimum frequency"
#endif

#if !((STM32_PLL2Q_ENABLED != TRUE) || (STM32_PLL2Q_FREQ <= STM32_PLLQ_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PLL2Q_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PLL2R clock point. ------------------------*/

#if !((STM32_CFG_PLL2R_VALUE >= 1) && (STM32_CFG_PLL2R_VALUE <= 128)) &&    \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_PLL2R_VALUE value specified"
#endif

/**
 * @brief   PLL2R clock register bits.
 */
#if (STM32_PLL2R_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2R_BITS                  ((STM32_CFG_PLL2R_VALUE -       \
                                              1U) << RCC_PLL2DIVR_PLL2R_Pos)
#else
  #define STM32_PLL2R_BITS                  0U
#endif

/**
 * @brief   PLL2 R output clock point.
 */
#if (STM32_PLL2R_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_PLL2R_FREQ                  (STM32_PLL2VCO_FREQ /           \
                                             STM32_CFG_PLL2R_VALUE)
#else
  #define STM32_PLL2R_FREQ                  0U
#endif
#define STM32_PLL2R_CLOCK                   hal_lld_get_clock_point(CLK_PLL2R)

