chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the PCLK1 clock point. ------------------------*/

/**
 * @brief   PCLK1 clock register bits.
 */
#if (STM32_CFG_PCLK1_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV1
#elif (STM32_CFG_PCLK1_VALUE == 2)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV2
#elif (STM32_CFG_PCLK1_VALUE == 4)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV4
#elif (STM32_CFG_PCLK1_VALUE == 8)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV8
#elif (STM32_CFG_PCLK1_VALUE == 16)
  #define STM32_PCLK1_BITS                  RCC_CFGR2_PPRE1_DIV16
#else
  #error "invalid STM32_CFG_PCLK1_VALUE value specified"
#endif

/**
 * @brief   APB1 clock point.
 */
#define STM32_PCLK1_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK1_VALUE)
#define STM32_PCLK1_CLOCK                   hal_lld_get_clock_point(CLK_PCLK1)

#if !((STM32_PCLK1_ENABLED != TRUE) || (STM32_PCLK1_FREQ <= STM32_PCLK1_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK1_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PCLK1TIM clock point. ---------------------*/

/**
 * @brief   PCLK1TIM clock register bits.
 */
#define STM32_PCLK1TIM_BITS                 0U

/**
 * @brief   APB1 timer clock point.
 */
#define STM32_PCLK1TIM_FREQ                 ((STM32_CFG_PCLK1_VALUE == 1) ? STM32_PCLK1_FREQ : \
                                             (STM32_PCLK1_FREQ * 2U))
#define STM32_PCLK1TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK1TIM)

/* --- Macros and checks for the PCLK2 clock point. ------------------------*/

/**
 * @brief   PCLK2 clock register bits.
 */
#if (STM32_CFG_PCLK2_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK2_BITS                  RCC_CFGR2_PPRE2_DIV1
#elif (STM32_CFG_PCLK2_VALUE == 2)
  #define STM32_PCLK2_BITS                  RCC_CFGR2_PPRE2_DIV2
#elif (STM32_CFG_PCLK2_VALUE == 4)
  #define STM32_PCLK2_BITS                  RCC_CFGR2_PPRE2_DIV4
#elif (STM32_CFG_PCLK2_VALUE == 8)
  #define STM32_PCLK2_BITS                  RCC_CFGR2_PPRE2_DIV8
#elif (STM32_CFG_PCLK2_VALUE == 16)
  #define STM32_PCLK2_BITS                  RCC_CFGR2_PPRE2_DIV16
#else
  #error "invalid STM32_CFG_PCLK2_VALUE value specified"
#endif

/**
 * @brief   APB2 clock point.
 */
#define STM32_PCLK2_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK2_VALUE)
#define STM32_PCLK2_CLOCK                   hal_lld_get_clock_point(CLK_PCLK2)

#if !((STM32_PCLK2_ENABLED != TRUE) || (STM32_PCLK2_FREQ <= STM32_PCLK2_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK2_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the PCLK2TIM clock point. ---------------------*/

/**
 * @brief   PCLK2TIM clock register bits.
 */
#define STM32_PCLK2TIM_BITS                 0U

/**
 * @brief   APB2 timer clock point.
 */
#define STM32_PCLK2TIM_FREQ                 ((STM32_CFG_PCLK2_VALUE == 1) ? STM32_PCLK2_FREQ : \
                                             (STM32_PCLK2_FREQ * 2U))
#define STM32_PCLK2TIM_CLOCK                hal_lld_get_clock_point(CLK_PCLK2TIM)

/* --- Macros and checks for the PCLK3 clock point. ------------------------*/

/**
 * @brief   PCLK3 clock register bits.
 */
#if (STM32_CFG_PCLK3_VALUE == 1) || defined(__DOXYGEN__)
  #define STM32_PCLK3_BITS                  RCC_CFGR3_PPRE3_DIV1
#elif (STM32_CFG_PCLK3_VALUE == 2)
  #define STM32_PCLK3_BITS                  RCC_CFGR3_PPRE3_DIV2
#elif (STM32_CFG_PCLK3_VALUE == 4)
  #define STM32_PCLK3_BITS                  RCC_CFGR3_PPRE3_DIV4
#elif (STM32_CFG_PCLK3_VALUE == 8)
  #define STM32_PCLK3_BITS                  RCC_CFGR3_PPRE3_DIV8
#elif (STM32_CFG_PCLK3_VALUE == 16)
  #define STM32_PCLK3_BITS                  RCC_CFGR3_PPRE3_DIV16
#else
  #error "invalid STM32_CFG_PCLK3_VALUE value specified"
#endif

/**
 * @brief   APB3 clock point.
 */
#define STM32_PCLK3_FREQ                    (STM32_HCLK_FREQ /              \
                                             STM32_CFG_PCLK3_VALUE)
#define STM32_PCLK3_CLOCK                   hal_lld_get_clock_point(CLK_PCLK3)

#if !((STM32_PCLK3_ENABLED != TRUE) || (STM32_PCLK3_FREQ <= STM32_PCLK3_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_PCLK3_FREQ above maximum frequency"
#endif

/* --- Macros and checks for the HSEDIV clock point. -----------------------*/

/**
 * @brief   HSEDIV clock register bits.
 */
#define STM32_HSEDIV_BITS                   0U

/**
 * @brief   HSE divided-by-32 RTC clock point.
 */
#if (STM32_HSEDIV_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSEDIV_FREQ                 (STM32_HSE_FREQ / 32U)
  #define STM32_HSEDIV_CLOCK                (STM32_HSE_CLOCK / 32U)
#else
  #define STM32_HSEDIV_FREQ                 0U
  #define STM32_HSEDIV_CLOCK                0U
#endif

/* --- Macros and checks for the MCODIV clock point. -----------------------*/

/**
 * @brief   MCODIV clock register bits.
 */
#if (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_NOCLOCK) || defined(__DOXYGEN__)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_NOCLOCK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_SYSCLK)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_SYSCLK
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_MSIS)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_MSIS
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSI16)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_HSI16
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSE)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_HSE
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_PLL1R)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_PLL1R
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_LSI)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_LSI
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_LSE)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_LSE
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSI48)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_HSI48
#elif (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_MSIK)
  #define STM32_MCODIV_BITS                 RCC_CFGR1_MCOSEL_MSIK
#else
  #error "invalid STM32_CFG_MCODIV_SEL value specified"
#endif

/**
 * @brief   MCO selected source before prescaler clock point.
 */
#if ((STM32_MCODIV_ENABLED == TRUE) && \
     (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_NOCLOCK)) || \
    defined(__DOXYGEN__)
  #define STM32_MCODIV_FREQ                 STM32_NONE_FREQ
  #define STM32_MCODIV_CLOCK                STM32_NONE_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_SYSCLK)
  #define STM32_MCODIV_FREQ                 STM32_SYSCLK_FREQ
  #define STM32_MCODIV_CLOCK                STM32_SYSCLK_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_MSIS)
  #define STM32_MCODIV_FREQ                 STM32_MSIS_FREQ
  #define STM32_MCODIV_CLOCK                STM32_MSIS_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSI16)
  #define STM32_MCODIV_FREQ                 STM32_HSI16_FREQ
  #define STM32_MCODIV_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSE)
  #define STM32_MCODIV_FREQ                 STM32_HSE_FREQ
  #define STM32_MCODIV_CLOCK                STM32_HSE_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_PLL1R)
  #define STM32_MCODIV_FREQ                 STM32_PLL1R_FREQ
  #define STM32_MCODIV_CLOCK                STM32_PLL1R_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_LSI)
  #define STM32_MCODIV_FREQ                 STM32_LSI_FREQ
  #define STM32_MCODIV_CLOCK                STM32_LSI_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_LSE)
  #define STM32_MCODIV_FREQ                 STM32_LSE_FREQ
  #define STM32_MCODIV_CLOCK                STM32_LSE_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_HSI48)
  #define STM32_MCODIV_FREQ                 STM32_HSI48_FREQ
  #define STM32_MCODIV_CLOCK                STM32_HSI48_CLOCK
#elif (STM32_MCODIV_ENABLED == TRUE) && \
      (STM32_CFG_MCODIV_SEL == RCC_CFGR1_MCOSEL_MSIK)
  #define STM32_MCODIV_FREQ                 STM32_MSIK_FREQ
  #define STM32_MCODIV_CLOCK                STM32_MSIK_CLOCK
#else
  #define STM32_MCODIV_FREQ                 0U
  #define STM32_MCODIV_CLOCK                0U
#endif

