chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the I2C2 clock point. -------------------------*/

/**
 * @brief   I2C2 clock register bits.
 */
#if (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_I2C2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C2_BITS                 RCC_CCIPR1_I2C2SEL_PCLK1
  #else
    #define STM32_I2C2_BITS                 0U
  #endif
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_SYSCLK)
  #if (STM32_I2C2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C2_BITS                 RCC_CCIPR1_I2C2SEL_SYSCLK
  #else
    #define STM32_I2C2_BITS                 0U
  #endif
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_HSI16)
  #if (STM32_I2C2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C2_BITS                 RCC_CCIPR1_I2C2SEL_HSI16
  #else
    #define STM32_I2C2_BITS                 0U
  #endif
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)
  #if (STM32_I2C2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C2_BITS                 RCC_CCIPR1_I2C2SEL_MSIK
  #else
    #define STM32_I2C2_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_I2C2_SEL value specified"
#endif

/**
 * @brief   I2C2 clock point.
 */
#if ((STM32_I2C2_ENABLED == TRUE) && \
     (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C2_FREQ                   STM32_PCLK1_FREQ
  #define STM32_I2C2_CLOCK                  STM32_PCLK1_CLOCK
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_SYSCLK)
  #define STM32_I2C2_FREQ                   STM32_SYSCLK_FREQ
  #define STM32_I2C2_CLOCK                  STM32_SYSCLK_CLOCK
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_HSI16)
  #define STM32_I2C2_FREQ                   STM32_HSI16_FREQ
  #define STM32_I2C2_CLOCK                  STM32_HSI16_CLOCK
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)
  #define STM32_I2C2_FREQ                   STM32_MSIK_FREQ
  #define STM32_I2C2_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_I2C2_FREQ                   0U
  #define STM32_I2C2_CLOCK                  0U
#endif

/* --- Macros and checks for the I2C4 clock point. -------------------------*/

/**
 * @brief   I2C4 clock register bits.
 */
#if (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_I2C4_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C4_BITS                 RCC_CCIPR1_I2C4SEL_PCLK1
  #else
    #define STM32_I2C4_BITS                 0U
  #endif
#elif (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_SYSCLK)
  #if (STM32_I2C4_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C4_BITS                 RCC_CCIPR1_I2C4SEL_SYSCLK
  #else
    #define STM32_I2C4_BITS                 0U
  #endif
#elif (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_HSI16)
  #if (STM32_I2C4_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C4_BITS                 RCC_CCIPR1_I2C4SEL_HSI16
  #else
    #define STM32_I2C4_BITS                 0U
  #endif
#elif (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_MSIK)
  #if (STM32_I2C4_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C4_BITS                 RCC_CCIPR1_I2C4SEL_MSIK
  #else
    #define STM32_I2C4_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_I2C4_SEL value specified"
#endif

/**
 * @brief   I2C4 clock point.
 */
#if ((STM32_I2C4_ENABLED == TRUE) && \
     (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C4_FREQ                   STM32_PCLK1_FREQ
  #define STM32_I2C4_CLOCK                  STM32_PCLK1_CLOCK
#elif (STM32_I2C4_ENABLED == TRUE) && \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_SYSCLK)
  #define STM32_I2C4_FREQ                   STM32_SYSCLK_FREQ
  #define STM32_I2C4_CLOCK                  STM32_SYSCLK_CLOCK
#elif (STM32_I2C4_ENABLED == TRUE) && \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_HSI16)
  #define STM32_I2C4_FREQ                   STM32_HSI16_FREQ
  #define STM32_I2C4_CLOCK                  STM32_HSI16_CLOCK
#elif (STM32_I2C4_ENABLED == TRUE) && \
      (STM32_CFG_I2C4_SEL == RCC_CCIPR1_I2C4SEL_MSIK)
  #define STM32_I2C4_FREQ                   STM32_MSIK_FREQ
  #define STM32_I2C4_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_I2C4_FREQ                   0U
  #define STM32_I2C4_CLOCK                  0U
#endif

/* --- Macros and checks for the I2C3 clock point. -------------------------*/

/**
 * @brief   I2C3 clock register bits.
 */
#if (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_PCLK3) || defined(__DOXYGEN__)
  #if (STM32_I2C3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C3_BITS                 RCC_CCIPR3_I2C3SEL_PCLK3
  #else
    #define STM32_I2C3_BITS                 0U
  #endif
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_SYSCLK)
  #if (STM32_I2C3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C3_BITS                 RCC_CCIPR3_I2C3SEL_SYSCLK
  #else
    #define STM32_I2C3_BITS                 0U
  #endif
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_HSI16)
  #if (STM32_I2C3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C3_BITS                 RCC_CCIPR3_I2C3SEL_HSI16
  #else
    #define STM32_I2C3_BITS                 0U
  #endif
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)
  #if (STM32_I2C3_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_I2C3_BITS                 RCC_CCIPR3_I2C3SEL_MSIK
  #else
    #define STM32_I2C3_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_I2C3_SEL value specified"
#endif

/**
 * @brief   I2C3 clock point.
 */
#if ((STM32_I2C3_ENABLED == TRUE) && \
     (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_PCLK3)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C3_FREQ                   STM32_PCLK3_FREQ
  #define STM32_I2C3_CLOCK                  STM32_PCLK3_CLOCK
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_SYSCLK)
  #define STM32_I2C3_FREQ                   STM32_SYSCLK_FREQ
  #define STM32_I2C3_CLOCK                  STM32_SYSCLK_CLOCK
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_HSI16)
  #define STM32_I2C3_FREQ                   STM32_HSI16_FREQ
  #define STM32_I2C3_CLOCK                  STM32_HSI16_CLOCK
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)
  #define STM32_I2C3_FREQ                   STM32_MSIK_FREQ
  #define STM32_I2C3_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_I2C3_FREQ                   0U
  #define STM32_I2C3_CLOCK                  0U
#endif

/* --- Macros and checks for the SPI1 clock point. -------------------------*/

/**
 * @brief   SPI1 clock register bits.
 */
#if (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_PCLK2) || defined(__DOXYGEN__)
  #if (STM32_SPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI1_BITS                 RCC_CCIPR1_SPI1SEL_PCLK2
  #else
    #define STM32_SPI1_BITS                 0U
  #endif
#elif (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_SYSCLK)
  #if (STM32_SPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI1_BITS                 RCC_CCIPR1_SPI1SEL_SYSCLK
  #else
    #define STM32_SPI1_BITS                 0U
  #endif
#elif (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_HSI16)
  #if (STM32_SPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI1_BITS                 RCC_CCIPR1_SPI1SEL_HSI16
  #else
    #define STM32_SPI1_BITS                 0U
  #endif
#elif (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_MSIK)
  #if (STM32_SPI1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_SPI1_BITS                 RCC_CCIPR1_SPI1SEL_MSIK
  #else
    #define STM32_SPI1_BITS                 0U
  #endif
#else
  #error "invalid STM32_CFG_SPI1_SEL value specified"
#endif

/**
 * @brief   SPI1 clock point.
 */
#if ((STM32_SPI1_ENABLED == TRUE) && \
     (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_PCLK2)) || \
    defined(__DOXYGEN__)
  #define STM32_SPI1_FREQ                   STM32_PCLK2_FREQ
  #define STM32_SPI1_CLOCK                  STM32_PCLK2_CLOCK
#elif (STM32_SPI1_ENABLED == TRUE) && \
      (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_SYSCLK)
  #define STM32_SPI1_FREQ                   STM32_SYSCLK_FREQ
  #define STM32_SPI1_CLOCK                  STM32_SYSCLK_CLOCK
#elif (STM32_SPI1_ENABLED == TRUE) && \
      (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_HSI16)
  #define STM32_SPI1_FREQ                   STM32_HSI16_FREQ
  #define STM32_SPI1_CLOCK                  STM32_HSI16_CLOCK
#elif (STM32_SPI1_ENABLED == TRUE) && \
      (STM32_CFG_SPI1_SEL == RCC_CCIPR1_SPI1SEL_MSIK)
  #define STM32_SPI1_FREQ                   STM32_MSIK_FREQ
  #define STM32_SPI1_CLOCK                  STM32_MSIK_CLOCK
#else
  #define STM32_SPI1_FREQ                   0U
  #define STM32_SPI1_CLOCK                  0U
#endif

