chibios-upstream/chibios/os/hal/ports/STM32/STM32U5xx/clocktree.h
/* --- Macros and checks for the LPTIM1 clock point. -----------------------*/

/**
 * @brief   LPTIM1 clock register bits.
 */
#if (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_MSIK) || defined(__DOXYGEN__)
  #if (STM32_LPTIM1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM1_BITS               RCC_CCIPR3_LPTIM1SEL_MSIK
  #else
    #define STM32_LPTIM1_BITS               0U
  #endif
#elif (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSI)
  #if (STM32_LPTIM1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM1_BITS               RCC_CCIPR3_LPTIM1SEL_LSI
  #else
    #define STM32_LPTIM1_BITS               0U
  #endif
#elif (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_HSI16)
  #if (STM32_LPTIM1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM1_BITS               RCC_CCIPR3_LPTIM1SEL_HSI16
  #else
    #define STM32_LPTIM1_BITS               0U
  #endif
#elif (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSE)
  #if (STM32_LPTIM1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM1_BITS               RCC_CCIPR3_LPTIM1SEL_LSE
  #else
    #define STM32_LPTIM1_BITS               0U
  #endif
#else
  #error "invalid STM32_CFG_LPTIM1_SEL value specified"
#endif

/**
 * @brief   LPTIM1 clock point.
 */
#if ((STM32_LPTIM1_ENABLED == TRUE) && \
     (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_MSIK)) || \
    defined(__DOXYGEN__)
  #define STM32_LPTIM1_FREQ                 STM32_MSIK_FREQ
  #define STM32_LPTIM1_CLOCK                STM32_MSIK_CLOCK
#elif (STM32_LPTIM1_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSI)
  #define STM32_LPTIM1_FREQ                 STM32_LSI_FREQ
  #define STM32_LPTIM1_CLOCK                STM32_LSI_CLOCK
#elif (STM32_LPTIM1_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_HSI16)
  #define STM32_LPTIM1_FREQ                 STM32_HSI16_FREQ
  #define STM32_LPTIM1_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_LPTIM1_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSE)
  #define STM32_LPTIM1_FREQ                 STM32_LSESYS_FREQ
  #define STM32_LPTIM1_CLOCK                STM32_LSESYS_CLOCK
#else
  #define STM32_LPTIM1_FREQ                 0U
  #define STM32_LPTIM1_CLOCK                0U
#endif

/* --- Macros and checks for the LPTIM2 clock point. -----------------------*/

/**
 * @brief   LPTIM2 clock register bits.
 */
#if (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_PCLK1) || defined(__DOXYGEN__)
  #if (STM32_LPTIM2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM2_BITS               RCC_CCIPR1_LPTIM2SEL_PCLK1
  #else
    #define STM32_LPTIM2_BITS               0U
  #endif
#elif (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSI)
  #if (STM32_LPTIM2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM2_BITS               RCC_CCIPR1_LPTIM2SEL_LSI
  #else
    #define STM32_LPTIM2_BITS               0U
  #endif
#elif (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_HSI16)
  #if (STM32_LPTIM2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM2_BITS               RCC_CCIPR1_LPTIM2SEL_HSI16
  #else
    #define STM32_LPTIM2_BITS               0U
  #endif
#elif (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSE)
  #if (STM32_LPTIM2_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM2_BITS               RCC_CCIPR1_LPTIM2SEL_LSE
  #else
    #define STM32_LPTIM2_BITS               0U
  #endif
#else
  #error "invalid STM32_CFG_LPTIM2_SEL value specified"
#endif

/**
 * @brief   LPTIM2 clock point.
 */
#if ((STM32_LPTIM2_ENABLED == TRUE) && \
     (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_LPTIM2_FREQ                 STM32_PCLK1_FREQ
  #define STM32_LPTIM2_CLOCK                STM32_PCLK1_CLOCK
#elif (STM32_LPTIM2_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSI)
  #define STM32_LPTIM2_FREQ                 STM32_LSI_FREQ
  #define STM32_LPTIM2_CLOCK                STM32_LSI_CLOCK
#elif (STM32_LPTIM2_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_HSI16)
  #define STM32_LPTIM2_FREQ                 STM32_HSI16_FREQ
  #define STM32_LPTIM2_CLOCK                STM32_HSI16_CLOCK
#elif (STM32_LPTIM2_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSE)
  #define STM32_LPTIM2_FREQ                 STM32_LSESYS_FREQ
  #define STM32_LPTIM2_CLOCK                STM32_LSESYS_CLOCK
#else
  #define STM32_LPTIM2_FREQ                 0U
  #define STM32_LPTIM2_CLOCK                0U
#endif

/* --- Macros and checks for the LPTIM34 clock point. ----------------------*/

/**
 * @brief   LPTIM34 clock register bits.
 */
#if (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_MSIK) ||                \
    defined(__DOXYGEN__)
  #if (STM32_LPTIM34_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM34_BITS              RCC_CCIPR3_LPTIM34SEL_MSIK
  #else
    #define STM32_LPTIM34_BITS              0U
  #endif
#elif (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSI)
  #if (STM32_LPTIM34_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM34_BITS              RCC_CCIPR3_LPTIM34SEL_LSI
  #else
    #define STM32_LPTIM34_BITS              0U
  #endif
#elif (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_HSI16)
  #if (STM32_LPTIM34_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM34_BITS              RCC_CCIPR3_LPTIM34SEL_HSI16
  #else
    #define STM32_LPTIM34_BITS              0U
  #endif
#elif (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSE)
  #if (STM32_LPTIM34_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_LPTIM34_BITS              RCC_CCIPR3_LPTIM34SEL_LSE
  #else
    #define STM32_LPTIM34_BITS              0U
  #endif
#else
  #error "invalid STM32_CFG_LPTIM34_SEL value specified"
#endif

/**
 * @brief   LPTIM3 and LPTIM4 clock point.
 */
#if ((STM32_LPTIM34_ENABLED == TRUE) && \
     (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_MSIK)) || \
    defined(__DOXYGEN__)
  #define STM32_LPTIM34_FREQ                STM32_MSIK_FREQ
  #define STM32_LPTIM34_CLOCK               STM32_MSIK_CLOCK
#elif (STM32_LPTIM34_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSI)
  #define STM32_LPTIM34_FREQ                STM32_LSI_FREQ
  #define STM32_LPTIM34_CLOCK               STM32_LSI_CLOCK
#elif (STM32_LPTIM34_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_HSI16)
  #define STM32_LPTIM34_FREQ                STM32_HSI16_FREQ
  #define STM32_LPTIM34_CLOCK               STM32_HSI16_CLOCK
#elif (STM32_LPTIM34_ENABLED == TRUE) && \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSE)
  #define STM32_LPTIM34_FREQ                STM32_LSESYS_FREQ
  #define STM32_LPTIM34_CLOCK               STM32_LSESYS_CLOCK
#else
  #define STM32_LPTIM34_FREQ                0U
  #define STM32_LPTIM34_CLOCK               0U
#endif

